serving/offloading/results_qwen3_kv32gb_offload4.39gb/bench_qwen3_kv32gb_offload4.39gb.log
  --- RPS = 1 ---
INFO 12-11 01:51:15 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71bc9a678220>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8008, endpoint='/v1/completions', header=None, max_concurrency=None, model='/scratch/shared_dir/unified_models/Qwen3-32B', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-11 01:51:22 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 02:05 elapsed, 23336:26:14 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [03:57<00:00,  2.38s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  237.56    
Total input tokens:                      9984      
Total generated tokens:                  90000     
Request throughput (req/s):              0.42      
Output token throughput (tok/s):         378.85    
Peak output token throughput (tok/s):    665.00    
Peak concurrent requests:                100.00    
Total Token throughput (tok/s):          420.87    
---------------Time to First Token----------------
Mean TTFT (ms):                          279.94    
Median TTFT (ms):                        280.73    
P95 TTFT (ms):                           385.55    
P99 TTFT (ms):                           548.76    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          155.66    
Median TPOT (ms):                        156.04    
P95 TPOT (ms):                           157.06    
P99 TPOT (ms):                           157.08    
---------------Inter-token Latency----------------
Mean ITL (ms):                           155.66    
Median ITL (ms):                         146.62    
P95 ITL (ms):                            170.91    
P99 ITL (ms):                            194.45    
==================================================
  --- RPS = 2 ---
INFO 12-11 01:57:32 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x70826f65c220>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8008, endpoint='/v1/completions', header=None, max_concurrency=None, model='/scratch/shared_dir/unified_models/Qwen3-32B', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-11 01:57:39 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 02:05 elapsed, 21777:55:17 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [03:14<00:00,  1.95s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  194.79    
Total input tokens:                      9984      
Total generated tokens:                  90000     
Request throughput (req/s):              0.51      
Output token throughput (tok/s):         462.03    
Peak output token throughput (tok/s):    656.00    
Peak concurrent requests:                100.00    
Total Token throughput (tok/s):          513.29    
---------------Time to First Token----------------
Mean TTFT (ms):                          236.39    
Median TTFT (ms):                        229.08    
P95 TTFT (ms):                           323.60    
P99 TTFT (ms):                           329.91    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          161.12    
Median TPOT (ms):                        161.42    
P95 TPOT (ms):                           161.69    
P99 TPOT (ms):                           161.70    
---------------Inter-token Latency----------------
Mean ITL (ms):                           161.12    
Median ITL (ms):                         167.66    
P95 ITL (ms):                            171.91    
P99 ITL (ms):                            173.98    
==================================================
  --- RPS = 5 ---
INFO 12-11 02:03:07 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7b1661930360>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8008, endpoint='/v1/completions', header=None, max_concurrency=None, model='/scratch/shared_dir/unified_models/Qwen3-32B', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-11 02:03:14 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 02:05 elapsed, 15004:53:39 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [02:49<00:00,  1.69s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  169.22    
Total input tokens:                      9984      
Total generated tokens:                  90000     
Request throughput (req/s):              0.59      
Output token throughput (tok/s):         531.87    
Peak output token throughput (tok/s):    647.00    
Peak concurrent requests:                100.00    
Total Token throughput (tok/s):          590.87    
---------------Time to First Token----------------
Mean TTFT (ms):                          228.77    
Median TTFT (ms):                        230.20    
P95 TTFT (ms):                           300.65    
P99 TTFT (ms):                           318.97    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          165.84    
Median TPOT (ms):                        165.96    
P95 TPOT (ms):                           166.06    
P99 TPOT (ms):                           166.06    
---------------Inter-token Latency----------------
Mean ITL (ms):                           165.84    
Median ITL (ms):                         168.89    
P95 ITL (ms):                            172.45    
P99 ITL (ms):                            174.79    
==================================================
  --- RPS = 10 ---
INFO 12-11 02:08:16 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7cb881870220>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8008, endpoint='/v1/completions', header=None, max_concurrency=None, model='/scratch/shared_dir/unified_models/Qwen3-32B', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=10.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-11 02:08:23 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 02:05 elapsed, 19843:00:49 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [02:40<00:00,  1.61s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  160.83    
Total input tokens:                      9984      
Total generated tokens:                  90000     
Request throughput (req/s):              0.62      
Output token throughput (tok/s):         559.61    
Peak output token throughput (tok/s):    647.00    
Peak concurrent requests:                100.00    
Total Token throughput (tok/s):          621.69    
---------------Time to First Token----------------
Mean TTFT (ms):                          232.08    
Median TTFT (ms):                        229.80    
P95 TTFT (ms):                           306.77    
P99 TTFT (ms):                           328.00    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          167.50    
Median TPOT (ms):                        167.54    
P95 TPOT (ms):                           167.61    
P99 TPOT (ms):                           167.61    
---------------Inter-token Latency----------------
Mean ITL (ms):                           167.50    
Median ITL (ms):                         168.76    
P95 ITL (ms):                            173.14    
P99 ITL (ms):                            174.97    
==================================================